Revit 2027 API
ParameterTypeId.StructuralSectionCommonCentroidHoriz Property
 "Centroid Horizontal"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralSectionCommonCentroidHoriz { get; }
Public Shared ReadOnly Property StructuralSectionCommonCentroidHoriz As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralSectionCommonCentroidHoriz {
	ForgeTypeId^ get ();
}
static member StructuralSectionCommonCentroidHoriz : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace